In [2]:
import pandas as pd

age_series = pd.Series([30, 45, 24, 28, 32, 36])
age_series

0    30
1    45
2    24
3    28
4    32
5    36
dtype: int64

In [3]:
import numpy as np

age2_series = pd.Series(np.array([50, 52, 44, 21, 37, 49]), index=np.arange(0, 12, 2))
age2_series

0     50
2     52
4     44
6     21
8     37
10    49
dtype: int32

In [8]:
age3_series = pd.Series(np.array([50, 52, 44, 21, 37, 49]), index=['A1', 'A2', 'A3', 'A4', 'A5', 'A6'])

age3_series

A1    50
A2    52
A3    44
A4    21
A5    37
A6    49
dtype: int32

In [5]:
prod_dict = { "Apples": 1200, "Oranges": 1150, "Bananas": 50, "Pears": 240 }

prod_series = pd.Series(prod_dict)
prod_series

Apples     1200
Oranges    1150
Bananas      50
Pears       240
dtype: int64

In [11]:
classes_dict = { "X": ["Maths", "Science", "English"],
                 "Y": ["Maths", "Science"],
                 "Z": "Science" 
               }
classes_series = pd.Series(classes_dict)

print(classes_series, "\n")
print(classes_series.index, "\n")
print(classes_series.values)

X    [Maths, Science, English]
Y             [Maths, Science]
Z                      Science
dtype: object

Index(['X', 'Y', 'Z'], dtype='object')

[list(['Maths', 'Science', 'English']) list(['Maths', 'Science'])
 'Science']

In [12]:
emp_array = np.array(["A101", "A102", "A103", "B101", "B102", "B103", "C101", "C102", "C104"])

emp_id_series = pd.Series(emp_array)

print(emp_id_series)
print(emp_id_series[:5])
print(emp_id_series[-5:])

0    A101
1    A102
2    A103
3    B101
4    B102
5    B103
6    C101
7    C102
8    C104
dtype: object
0    A101
1    A102
2    A103
3    B101
4    B102
dtype: object
4    B102
5    B103
6    C101
7    C102
8    C104
dtype: object

In [19]:
print(classes_series, "\n")

print( classes_series["Z"], "\n")

print(classes_series[["X", "Y"]])

X    [Maths, Science, English]
Y             [Maths, Science]
Z                      Science
dtype: object

Science

X    [Maths, Science, English]
Y             [Maths, Science]
dtype: object

In [20]:
student_series = pd.Series(np.array([450, 129, 313, 450, 215, 116]), 
                           index=["Sophia", "Mia", "Emma", "William", "lily", "Grace"])

student_series[student_series > 300]

Sophia     450
Emma       313
William    450
dtype: int32

In [21]:
sales_array = np.array([1200, 3200, 2400])

sales_series = pd.Series(sales_array)
sales_series * 2

0    2400
1    6400
2    4800
dtype: int32

In [23]:
MRP_series = pd.Series([12, 15, 17])
sales_series = pd.Series([23, 43, 34])

total_amt_series1 = MRP_series.multiply(sales_series)

print(total_amt_series1, "\n")

total_amt_series2 = MRP_series + sales_series
print(total_amt_series2, "\n")

0    276
1    645
2    578
dtype: int64

0    35
1    58
2    51
dtype: int64

In [24]:
MRP_series1 = pd.Series([12, 15, 17])
sales_series1 = pd.Series([23, 43])

total_amt_series3 = MRP_series1 + sales_series1
total_amt_series3

0    35.0
1    58.0
2     NaN
dtype: float64

In [25]:
score_array = np.array([121, 212, 153, 214, 115, 116, 237, 118, 219, 120])
score_series = pd.Series(score_array)

score_series.rank() #rank elements in ascending order starting from 1 rank

0     5.0
1     7.0
2     6.0
3     8.0
4     1.0
5     2.0
6    10.0
7     3.0
8     9.0
9     4.0
dtype: float64

In [27]:
score_array1 = np.array([121, 212, np.nan, 214, 115, 116, np.nan, 118, np.nan, 120])
score_series1 = pd.Series(score_array1)

score_series1.sort_values(ascending=True, na_position = 'last')
score_series1.sort_values(ascending=True, na_position = 'first')

2      NaN
6      NaN
8      NaN
4    115.0
5    116.0
7    118.0
9    120.0
0    121.0
1    212.0
3    214.0
dtype: float64

In [28]:
score_array2 = np.array([121, 212, np.nan, 214, 115, 116, np.nan, 118, np.nan, 120])
score_series2 = pd.Series(score_array2, index = [112, 101, 100, 104, 102, 105, 107, 109, 106, 110])

score_series2.sort_index(ascending=True)

100      NaN
101    212.0
102    115.0
104    214.0
105    116.0
106      NaN
107      NaN
109    118.0
110    120.0
112    121.0
dtype: float64

In [29]:
score_series2.isnull()

112    False
101    False
100     True
104    False
102    False
105    False
107     True
109    False
106     True
110    False
dtype: bool

In [30]:
score_series2.notnull()

112     True
101     True
100    False
104     True
102     True
105     True
107    False
109     True
106    False
110     True
dtype: bool

In [32]:
class1 = np.linspace(start=0, stop=20, num=11)
class2 = np.linspace(start=1, stop=21, num=11)

class1_series = pd.Series(data=class1)
class2_series = pd.Series(data=class2)

pd.concat([class1_series, class2_series], keys=["Even", "Odd"], names=["Category", "Index"])

Category  Index
Even      0         0.0
          1         2.0
          2         4.0
          3         6.0
          4         8.0
          5        10.0
          6        12.0
          7        14.0
          8        16.0
          9        18.0
          10       20.0
Odd       0         1.0
          1         3.0
          2         5.0
          3         7.0
          4         9.0
          5        11.0
          6        13.0
          7        15.0
          8        17.0
          9        19.0
          10       21.0
dtype: float64

In [34]:
class1_series.append(class2_series, ignore_index=True)

0      0.0
1      2.0
2      4.0
3      6.0
4      8.0
5     10.0
6     12.0
7     14.0
8     16.0
9     18.0
10    20.0
11     1.0
12     3.0
13     5.0
14     7.0
15     9.0
16    11.0
17    13.0
18    15.0
19    17.0
20    19.0
21    21.0
dtype: float64

In [36]:
data_science = ["R", "Python", "SAS", "SPSS"]

df = pd.DataFrame(data_science, columns=['Tools'])
print(df)

    Tools
0       R
1  Python
2     SAS
3    SPSS

In [37]:
store_list = [ ["Vivo", 30000], ["Oppo", 40000], ["Samsung", 78000], ["Apple", 200000] ]

df = pd.DataFrame(store_list, columns = ["Store", "Sales"])
print(df)

     Store   Sales
0     Vivo   30000
1     Oppo   40000
2  Samsung   78000
3    Apple  200000

In [38]:
store_data = {"Product": ["Tea", "Coffee", "Milk", "Sugar"], "Sales": [24000, 45000, 56000, 34000]}

df = pd.DataFrame(store_data, index=["A", "B", "C", "D"])
print(df)

  Product  Sales
A     Tea  24000
B  Coffee  45000
C    Milk  56000
D   Sugar  34000

In [40]:
store_data = [ {"Store-A": 1010, "Store-B": 2102}, {"Store-A": 3105, "Store-B": 4110, "Store-C": 2120} ]

df_store = pd.DataFrame(store_data)
print(df_store)

   Store-A  Store-B  Store-C
0     1010     2102      NaN
1     3105     4110   2120.0

In [41]:
print(type(df_store))
print(type(store_data))
print(type(df_store["Store-A"]))

<class 'pandas.core.frame.DataFrame'>
<class 'list'>
<class 'pandas.core.series.Series'>

In [58]:
my_sales = pd.read_csv(r"C:\zubeda\PGA-02\Python\Datasets\Pandas\bigmarket.csv")

my_sales.head()

  Month Store  Sales
0   Jan     A  31037
1   Jan     B  20722
2   Jan     C  24557
3   Jan     D  34649
4   Jan     E  29795

In [52]:
my_sales.tail()

   Month Store  Sales
20   May     A  29487
21   May     B  40001
22   May     C  46482
23   May     D  46313
24   May     E  47594

In [53]:
import zipfile
with zipfile.ZipFile(r"C:\zubeda\PGA-02\Python\Datasets\Pandas\bigmarket.zip") as z:
    with z.open("bigmarket.csv") as f:
        train = pd.read_csv(f, header=0)
        print(train)

    Month Store  Sales
0     Jan     A  31037
1     Jan     B  20722
2     Jan     C  24557
3     Jan     D  34649
4     Jan     E  29795
5     Feb     A  29133
6     Feb     B  22695
7     Feb     C  28312
8     Feb     D  31454
9     Feb     E  46267
10  March     A  32961
11  March     B  26451
12  March     C  47814
13  March     D  36069
14  March     E  31874
15    Apr     A  27253
16    Apr     B  40241
17    Apr     C  47488
18    Apr     D  25432
19    Apr     E  33880
20    May     A  29487
21    May     B  40001
22    May     C  46482
23    May     D  46313
24    May     E  47594

In [59]:
df_sales = pd.read_csv(r"C:\zubeda\PGA-02\Python\Datasets\Pandas\bigmarket.txt", sep="\t")
df_sales

    Month Store  Sales
0     Jan     A  31037
1     Jan     B  20722
2     Jan     C  24557
3     Jan     D  34649
4     Jan     E  29795
5     Feb     A  29133
6     Feb     B  22695
7     Feb     C  28312
8     Feb     D  31454
9     Feb     E  46267
10  March     A  32961
11  March     B  26451
12  March     C  47814
13  March     D  36069
14  March     E  31874
15    Apr     A  27253
16    Apr     B  40241
17    Apr     C  47488
18    Apr     D  25432
19    Apr     E  33880
20    May     A  29487
21    May     B  40001
22    May     C  46482
23    May     D  46313
24    May     E  47594

In [60]:
df_sales1 = pd.read_json(r"C:\zubeda\PGA-02\Python\Datasets\Pandas\bigmarket.json")
df_sales1.head()

  Month Store  Sales
0   Jan     A  31037
1   Jan     B  20722
2   Jan     C  24557
3   Jan     D  34649
4   Jan     E  29795

In [65]:
df_sales2 = pd.read_html(r"C:\zubeda\PGA-02\Python\Datasets\Pandas\bigmarket.html")

In [6]:
df_sales3 = pd.read_excel(r"C:\zubeda\PGA-02\Python\Datasets\Pandas\bigmarket.xlsx")
df_sales3.head()

  Month Store  Sales
0   Jan     A  31037
1   Jan     B  20722
2   Jan     C  24557
3   Jan     D  34649
4   Jan     E  29795